Revit 2027 API
RebarUpdateCurvesData.GetTerminationRotationAngle Method
 Gets the termination's (e.g hook, crank) rotation angle (in radians) at end that is currently in the rebar.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double GetTerminationRotationAngle(
	int end
)
Public Function GetTerminationRotationAngle (
	end As Integer
) As Double
public:
double GetTerminationRotationAngle(
	int end
)
member GetTerminationRotationAngle :
        end : int -> float
Parameters
end Int32
 The end of bar. Should be 0 for start or 1 for end.
Return Value
Double
 Returns the termination's (e.g hook, crank) rotation angle (in radians) at end that is currently in the rebar.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  Invalid end.
See Also
Reference
RebarUpdateCurvesData Class
Autodesk.Revit.DB.Structure Namespace